#сложение
s1='water'
s2='melon'
print(s1+s2)
print(s2+s1)

#Дублирование строки
print('main'*5)

st = 35 * '*'
print(st)

#Доступ по индексу
W='blame'
#Vyvod
#>>> W[0]
#'b'
#>>> W[2]
#'a'

s1 = 'Hello, world!'
s2 = "Hello, world2"
s3 = '''Используем тройные
кавычки для вывода
многострочного текста'''


s1 = 'Иван Иванов'
s2 = 'Иван'
if s2 in s1: # Проверяем, есть ли «содержимое» строки s2 в s1
    print('Пользователь Иван есть в нашей базе данных')
else:
    print('Пользователь Иван в базе данных отсутствует')

st = 'a'
if st == 'a' or st == 'b' or st == 'c' or st == 'd':
     print('YES')
    .
